In [1]:
import pandas as pd

In [2]:
order_data = pd.read_csv("https://raw.githubusercontent.com/Laxminarayen/Inceptez_batch_16/main/orders.csv" )

In [4]:
sales_data = pd.read_csv("https://raw.githubusercontent.com/Laxminarayen/Inceptez_batch_16/main/sales_team.csv")

In [7]:
sales_data.head(15)

,Sales Rep,Sales Rep Id,Company Name,Company Id
0,Jessie Mcallister,97UNNAT790E0WM4N,Chimera-Chasing Casbah,LJKS5NK6788CYMUU
1,Jessie Mcallister,97UNNAT790E0WM4N,Tangential Sheds,36MFTZOYMTAJP1RK
2,Jessie Mcallister,97UNNAT790E0WM4N,Two-Mile Grab,H3JRC7XX7WJAD4ZO
3,Jessie Mcallister,97UNNAT790E0WM4N,Three-Men-And-A-Helper Congo'S,HB25MDZR0MGCQUGX
4,Jessie Mcallister,97UNNAT790E0WM4N,Biophysical Battleground,7RVA8TIVBLBXMNO4
5,Jessie Mcallister,97UNNAT790E0WM4N,Verbal Greenwich,KKM6EZRN9W5NYXP6
6,Jessie Mcallister,97UNNAT790E0WM4N,Unpremeditated Heliopolis,NBJDWUB8J2DHLH29
7,Jessie Mcallister,97UNNAT790E0WM4N,Excitatory Joint,D3Q0HECTK80RRGGO
8,Jessie Mcallister,97UNNAT790E0WM4N,Dandy Fist,KGJBNJQHPF0WZ6SI
9,Jessie Mcallister,97UNNAT790E0WM4N,Various Caesar,7FLAHMERFCITB6RT
10,Jessie Mcallister,97UNNAT790E0WM4N,Unhesitant Capercailzie,JYRK7UHZXGX4DLSX
11,Jessie Mcallister,97UNNAT790E0WM4N,Priestly Item-Categories,TAW7IY2L2IKUCCGC
12,Jessie Mcallister,97UNNAT790E0WM4N,Paleocortical Boatloads,NUQS9SHQH6IU92V8
13,Jessie Mcallister,97UNNAT790E0WM4N,Editorial Paintbrush,PQ79N68UEQ9FFCPU
14,Jessie Mcallister,97UNNAT790E0WM4N,Victorian Aim,93DU98KT3NZCOW58

In [8]:
sales_data.head(5)

,Sales Rep,Sales Rep Id,Company Name,Company Id
0,Jessie Mcallister,97UNNAT790E0WM4N,Chimera-Chasing Casbah,LJKS5NK6788CYMUU
1,Jessie Mcallister,97UNNAT790E0WM4N,Tangential Sheds,36MFTZOYMTAJP1RK
2,Jessie Mcallister,97UNNAT790E0WM4N,Two-Mile Grab,H3JRC7XX7WJAD4ZO
3,Jessie Mcallister,97UNNAT790E0WM4N,Three-Men-And-A-Helper Congo'S,HB25MDZR0MGCQUGX
4,Jessie Mcallister,97UNNAT790E0WM4N,Biophysical Battleground,7RVA8TIVBLBXMNO4

In [15]:
order_data.head(5)

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal,Heroes Adjustment
0,839FKFW2LLX4LMBB,2016-05-27,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469.0,Breakfast,False
1,97OX39BGVMHODLJM,2018-09-27,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],22.0,Dinner,False
2,041ORQM5OIHTIU6L,2014-08-24,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 14:00:00+02:00,['Karen Stansell'],314.0,Lunch,False
3,YT796QI18WNGZ7ZJ,2014-04-12,C9SDFHF7553BE247,LJKS5NK6788CYMUU,2014-04-07 21:00:00+02:00,['Addie Patino'],438.0,Dinner,False
4,6YLROQT27B6HRF4E,2015-07-28,48EQXS6IHYNZDDZ5,LJKS5NK6788CYMUU,2015-07-27 14:00:00+02:00,['Addie Patino' 'Susan Guerrero'],690.0,Lunch,False

In [16]:
result = pd.merge( order_data, sales_data, on = 'Company Id', how = 'right')

In [18]:
result

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal,Heroes Adjustment,Sales Rep,Sales Rep Id,Company Name
0,839FKFW2LLX4LMBB,2016-05-27,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469.0,Breakfast,False,Jessie Mcallister,97UNNAT790E0WM4N,Chimera-Chasing Casbah
1,97OX39BGVMHODLJM,2018-09-27,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],22.0,Dinner,False,Jessie Mcallister,97UNNAT790E0WM4N,Chimera-Chasing Casbah
2,041ORQM5OIHTIU6L,2014-08-24,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 14:00:00+02:00,['Karen Stansell'],314.0,Lunch,False,Jessie Mcallister,97UNNAT790E0WM4N,Chimera-Chasing Casbah
3,YT796QI18WNGZ7ZJ,2014-04-12,C9SDFHF7553BE247,LJKS5NK6788CYMUU,2014-04-07 21:00:00+02:00,['Addie Patino'],438.0,Dinner,False,Jessie Mcallister,97UNNAT790E0WM4N,Chimera-Chasing Casbah
4,6YLROQT27B6HRF4E,2015-07-28,48EQXS6IHYNZDDZ5,LJKS5NK6788CYMUU,2015-07-27 14:00:00+02:00,['Addie Patino' 'Susan Guerrero'],690.0,Lunch,False,Jessie Mcallister,97UNNAT790E0WM4N,Chimera-Chasing Casbah
...,...,...,...,...,...,...,...,...,...,...,...,...
17715,NaN,NaN,NaN,4JW3GG4YW52M86F5,NaN,NaN,NaN,NaN,NaN,Joel Woodbury,YBWRC1WQHXE895WV,Jammed-Together Stable
17716,NaN,NaN,NaN,R0KV9HJ7RIRRYSVG,NaN,NaN,NaN,NaN,NaN,Joel Woodbury,YBWRC1WQHXE895WV,Laureate Barbital
17717,NaN,NaN,NaN,5K17HYJQ6JG6UFU0,NaN,NaN,NaN,NaN,NaN,Hazel Dickerson,NIW73ZQMGEOB7BHT,Spotty Adoniram
17718,NaN,NaN,NaN,FC1LJXHNH2883N3Y,NaN,NaN,NaN,NaN,NaN,Hazel Dickerson,NIW73ZQMGEOB7BHT,Physicochemical Impatience
17719,NaN,NaN,NaN,E4K99D4JR9E40VE1,NaN,NaN,NaN,NaN,NaN,Hazel Dickerson,NIW73ZQMGEOB7BHT,Fierce Productivity

In [32]:
pd.pivot_table(result, index=['Type of Meal', 'Company Id', 'Order Id', 'Participants'], aggfunc='mean')

                                                                                                   Meal Price
Type of Meal Company Id       Order Id         Participants
Breakfast    00CVEIVO8C92FFBO 0FS49F5GB2DVZD5S ['Cathy Hill' 'Debra Antoniou']                          207.0
                              FEVFF6CUNLQ5JYAC ['Bill Tollison' 'Cathy Hill']                           431.0
                              PGSXSJMONTR1NE7U ['Debra Antoniou']                                       606.0
                              YI4M1UD5PNTMJD1A ['Cathy Hill']                                           142.0
             00WJ866YXWT58K2S 1D30Z5503W160ZEA ['Lila Hamilton']                                        378.0
...                                                                                                       ...
Lunch        ZZY3WSHGJWPKJBCV G68OAJ1HW84R5N3K ['Patricia Kuhl']                                        439.0
                              TS3OXKBKNDAE6QPX ['George Sanders']                                       763.0
                              VC78MCMUDZWNGBZT ['George Sanders' 'Theresa Taylor' 'Rachael Mcl...       332.0
             ZZYB9JLJKXRH7U6O BQRUD0AK8R1WZG25 ['David Bailey']                                          91.0
                              U0KN481R9S04OEE6 ['Maria Gazzo' 'Ethel Sharp']                            207.0

[14361 rows x 1 columns]

In [19]:
import numpy as np

In [20]:
order_data.head(5)

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal,Heroes Adjustment
0,839FKFW2LLX4LMBB,2016-05-27,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469.0,Breakfast,False
1,97OX39BGVMHODLJM,2018-09-27,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],22.0,Dinner,False
2,041ORQM5OIHTIU6L,2014-08-24,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 14:00:00+02:00,['Karen Stansell'],314.0,Lunch,False
3,YT796QI18WNGZ7ZJ,2014-04-12,C9SDFHF7553BE247,LJKS5NK6788CYMUU,2014-04-07 21:00:00+02:00,['Addie Patino'],438.0,Dinner,False
4,6YLROQT27B6HRF4E,2015-07-28,48EQXS6IHYNZDDZ5,LJKS5NK6788CYMUU,2015-07-27 14:00:00+02:00,['Addie Patino' 'Susan Guerrero'],690.0,Lunch,False

In [30]:
pd.pivot_table(order_data, index=['Type of Meal', 'Company Id',], aggfunc='mean')

                               Meal Price
Type of Meal Company Id
Breakfast    00CVEIVO8C92FFBO  346.500000
             00WJ866YXWT58K2S  392.166667
             01W2DWJSSYIMC2CP  611.333333
             0215YHE3CHAJKSYO  243.500000
             02JRY9T4F276E98L  486.666667
...                                   ...
Dinner       ZXS1AR3G66YR07K4  273.666667
             ZY7DXD1BH8M8N2UW  405.000000
             ZZ2R72YGH1JQH2OB  671.000000
             ZZY3WSHGJWPKJBCV  351.428571
             ZZYB9JLJKXRH7U6O  336.000000

[3976 rows x 1 columns]

In [21]:
order_data["Type of Meal"] = order_data["Type of Meal"].astype("category")

In [23]:
order_data["Type of Meal"].cat.set_categories(["Breakfast","Lunch","Dinner",],inplace=True)

In [26]:
pd.pivot_table(order_data,index=["Order Id"])

                  Meal Price
Order Id
004H6KUZSJC1Y3SK       442.0
0099OXOCYPE6BYWT       761.0
00BIZJZD3B2HDKJE       445.0
00GG73YP63IV2WL9       433.0
00IB1RZYN9757Z89        31.0
...                      ...
ZZBCQAHIJIXBEHC6        21.0
ZZLOPQCTI21V9BGJ       698.0
ZZMNUEKNRDOC92XK       204.0
ZZXEN0FQX4SZ3YIN        82.0
ZZXZ74N6LMWU3ROU       168.0

[14361 rows x 1 columns]

In [41]:
x= 2

In [42]:
x**2

4

In [43]:
num = 1,2,3,4,5,6,7,8,9

In [46]:
square_list = list(map(lambda x : x**2, num))

In [49]:
square_list

[1, 4, 9, 16, 25, 36, 49, 64, 81]

In [50]:
a = [1,2,3,4,5,6]
b = [6,7,8,9,1,2]
multiply_list = list(map(lambda a,b : a*b,a,b))

In [51]:
multiply_list

[6, 14, 24, 36, 5, 12]

In [65]:
name = ['jack', 'sparrow', 'harry', 'potter']
index = [1,2,3,4]
index_list = list(map(lambda a,b : (a,b), name,index))

In [62]:
index_list

[('jack', 1), ('sparrow', 2), ('harry', 3), ('potter', 4)]

In [70]:
float = [4.77, 5.88, 9.77]
float_list = list(map(int, float))

In [67]:
float_list

[5, 6, 10]

In [77]:
name = 'sharAVAnA'
name.lower()

'sharavana'

In [80]:
name = 'sharavana'
name.upper()

'SHARAVANA'

In [92]:
words = ['inceptez','crd','btch']
vowels = ['a','e','i','o','u']

In [93]:
vol = [ i for i in words for j in i if j in vowels]

In [94]:
vol

['inceptez', 'inceptez', 'inceptez']

In [1]:
import pandas as pd

In [17]:
India_weather = {
    "states" : ["Mumbai", "Chennai", "Bangalore"],
    "tmperature" : [30,32,28],
    "humidity" : [70,60,70]
}
Data_India = pd.DataFrame(India_weather)

In [18]:
Data_India

      states  tmperature  humidity
0     Mumbai          30        70
1    Chennai          32        60
2  Bangalore          28        70

In [19]:
USA_weather = {
    "states" : ["newyork", "orlando", "chicago"],
    "tmperature" : [21,15,18],
    "humidity" : [65,60,62]
}
Data_USA = pd.DataFrame(USA_weather)

In [20]:
Data_USA

    states  tmperature  humidity
0  newyork          21        65
1  orlando          15        60
2  chicago          18        62

In [33]:
df = pd.concat([Data_India, Data_USA], ignore_index = True)

In [34]:
df

      states  tmperature  humidity
0     Mumbai          30        70
1    Chennai          32        60
2  Bangalore          28        70
3    newyork          21        65
4    orlando          15        60
5    chicago          18        62

In [35]:
mumbai = {
    "players" : ["Rohit", "Pandya", "Pollard"],
    "scores" : [45,56,60],
    "strikerate" : [130,150,155]
}
Data_mumbai = pd.DataFrame(mumbai)

In [36]:
Data_mumbai

   players  scores  strikerate
0    Rohit      45         130
1   Pandya      56         150
2  Pollard      60         155

In [37]:
chennai = {
    "players" : ["Dhoni", "Moeen", "Curran"],
    "scores" : [40,60,40],
    "strikerate" : [100,165,170]
}
Data_chennai = pd.DataFrame(chennai)

In [38]:
Data_chennai

  players  scores  strikerate
0   Dhoni      40         100
1   Moeen      60         165
2  Curran      40         170

In [43]:
df = pd.concat([Data_mumbai,Data_chennai], keys = ["Mumbai", "Chennai"])

In [44]:
df

           players  scores  strikerate
Mumbai  0    Rohit      45         130
        1   Pandya      56         150
        2  Pollard      60         155
Chennai 0    Dhoni      40         100
        1    Moeen      60         165
        2   Curran      40         170

In [49]:
temperature_df = pd.DataFrame ({
    "city" : ["chennai", "mumbai", "kerala"],
    "temperature" : [32,29,27]
}, index=[0,1,2])

In [50]:
temperature_df

      city  temperature
1  chennai           32
2   mumbai           29
3   kerala           27

In [51]:
windspeed_df = pd.DataFrame ({
    "city" : ["chennai", "mumbai", "kerala"],
    "windspeed" : [32,29,27]
}, index=[0,1,2])

In [52]:
windspeed_df

      city  windspeed
1  chennai         32
2   mumbai         29
3   kerala         27

In [62]:
df = pd.concat([temperature_df,windspeed_df], ignore_index = True )

In [63]:
df

      city  temperature  windspeed
0  chennai         32.0        NaN
1   mumbai         29.0        NaN
2   kerala         27.0        NaN
3  chennai          NaN       32.0
4   mumbai          NaN       29.0
5   kerala          NaN       27.0

In [55]:
df.shape

(6, 3)

In [56]:
df.values.tolist()

[['chennai', 32.0, nan],
 ['mumbai', 29.0, nan],
 ['kerala', 27.0, nan],
 ['chennai', nan, 32.0],
 ['mumbai', nan, 29.0],
 ['kerala', nan, 27.0]]

In [57]:
df.index.tolist()

[1, 2, 3, 1, 2, 3]

In [81]:
df

      city  temperature series
0      NaN          NaN  humid
1  chennai         32.0    Dry
2   mumbai         29.0   rain
3   kerala         27.0    NaN

In [82]:
df = pd.concat([temperature_df,windspeed_df], axis = 1 )

In [83]:
df

      city  temperature     city  windspeed
1  chennai           32  chennai         32
2   mumbai           29   mumbai         29
3   kerala           27   kerala         27

In [80]:
temperature_df

      city  temperature
1  chennai           32
2   mumbai           29
3   kerala           27

In [84]:
ser = pd.Series(["humid","Dry","rain"], name = "series", index = ['1','2',3])

In [85]:
ser

1    humid
2      Dry
3     rain
Name: series, dtype: object

In [86]:
df = pd.concat([temperature_df,ser], axis = 1)

In [87]:
df

      city  temperature series
1  chennai         32.0    NaN
2   mumbai         29.0    NaN
3   kerala         27.0   rain
1      NaN          NaN  humid
2      NaN          NaN    Dry

In [2]:
import pandas as pd
import numpy as np

In [3]:
USA_weather = {
    "states" : ["newyork", "orlando", "chicago"],
    "tmperature" : [21,15,18],
    "humidity" : [65,60,62]
}
Data_USA = pd.DataFrame(USA_weather)

In [4]:
display(Data_USA)

    states  tmperature  humidity
0  newyork          21        65
1  orlando          15        60
2  chicago          18        62

In [5]:
Data_USA.stack()

0  states        newyork
   tmperature         21
   humidity           65
1  states        orlando
   tmperature         15
   humidity           60
2  states        chicago
   tmperature         18
   humidity           62
dtype: object